package tests;

import com.github.javafaker.Faker;

public class TestData {

    Faker faker = new Faker();

    public String regionName = faker.options().option("Алтайский край", "Амурская область", "Архангельская область",
            "Астраханская область", "Белгородская область", "Брянская область", "Владимирская область", "Волгоградская область",
            "Вологодская область", "Воронежская область", "Еврейская автономкая область", "Забайкальский край", "Ивановская область",
            "Иркутская область", "Кабардино-Балкарская Республика", "Калининградская область", "Калужская область", "Камчатский Край",
            "Карачаево-Черкассекая Республика", "Кемеровская область", "Кировская область", "Костромская область", "Краснодарский край",
            "Красноярский край", "Курганская область", "Курская область", "Ленинградская область", "Липецкая область", "Магаданская область",
            "Москва", "Московская область", "Мурманская область", "Ненецкий автономный округ", "Нижегородская область", "Новгородская область",
            "Новосибирская область", "Омская область", "Оренбургская область", "Орловская область", "Пензенская область", "Пермский край",
            "Приморский край", "Псковская область", "Республица Адыгея", "Республица Алтай", "Республика Башкортостан", "Республика Бурятия",
            "Республика Дагестан", "Республика Ингушетия", "Республика Калмыкия", "Республика Карелия", "Республика Коми", "Республика Крым",
            "Республика Марий Эл", "Республика Мордовия", "Республика Саха (Якутия)", "Республика Татарастан", "Республика Тыва", "Республика Хакасия",
            "Ростовская область", "Рязанская область", "Самарская область", "Санкт-Петербург", "Саратовская область", "Сахалинская область",
            "Свердловская область", "Смоленская область", "Ставропольский край", "Тамбовская область", "Тверская область", "Томская область",
            "Тульская область", "Тюменская область", "Удмуртская область", "Ульяновская область", "Хабаровский край", "Ханты-Мансийский автономный округ",
            "Челябинская область", "Чеченская область", "Чувашская область", "Чукотский автономный округ", "Ямало-Ненецкий автономный округ",
            "Ярославская область"),
            userName = "RichardMilly",
            userPassword = "F3#C8r3)ZJ",
            randomEmail = faker.internet().emailAddress(),
            randomPassword = faker.internet().password(),
            registrationNumberAuto = faker.options().option("Р145АУ198", "Х309РМ55", "А302ХС790"),
            randomCarModel = faker.options().option("BMW", "Audi", "Toyota", "Tank", "Zeekr", "EXEED", "Geely");

}
